### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks_blueprints.kubernetes_config_map.aws_auth[0] will be updated in-place
!   resource "kubernetes_config_map" "aws_auth" {
!       data        = {
!           "mapRoles"    = <<-EOT
-                 "groups":
-                   "system:bootstrappers"
-                   "system:nodes"
                  "rolearn": "arn:aws:iam::484752921218:role/jingood2-dev-eks-general"
                  "username": "system:node:{{EC2PrivateDNSName}}"
-                 "groups":
-                   "system:masters"
+                 "rolearn": "arn:aws:iam::484752921218:role/jingood2-dev-eks-admin-access"
+                 "username": "admin"
+               - "groups":
+                 - "system:masters"
                  "rolearn": "arn:aws:iam::484752921218:role/eks-admin-role"
                  "username": "eks-admin-role"
            EOT
            # (2 unchanged elements hidden)
        }
        id          = "kube-system/aws-auth"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].data.aws_iam_policy_document.managed_ng_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "managed_ng_assume_role_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           sid     = "EKSWorkerAssumeRole"

+           principals {
+               identifiers = [
+                   "ec2.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_iam_role.managed_ng[0] will be updated in-place
!   resource "aws_iam_role" "managed_ng" {
!       assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "ec2.amazonaws.com"
                        }
-                       Sid       = "EKSWorkerAssumeRole"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "jingood2-dev-eks-general"
        name                  = "jingood2-dev-eks-general"
        tags                  = {
            "environment" = "dev"
            "owners"      = "jingood2"
        }
        # (9 unchanged attributes hidden)
    }

  # module.eks_blueprints.module.aws_eks_teams[0].aws_iam_policy.platform_team_eks_access[0] will be created
+   resource "aws_iam_policy" "platform_team_eks_access" {
+       arn         = (known after apply)
+       description = "Platform Team EKS Console Access"
+       id          = (known after apply)
+       name        = "jingood2-dev-eks-PlatformTeamEKSAccess"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ssm:GetParameter",
+                           "eks:ListUpdates",
+                           "eks:ListNodegroups",
+                           "eks:ListFargateProfiles",
+                           "eks:ListClusters",
+                           "eks:DescribeNodegroup",
+                           "eks:DescribeCluster",
+                           "eks:AccessKubernetesApi",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:eks:us-east-1:484752921218:cluster/jingood2-dev-eks"
+                       Sid      = "AllowPlatformTeamEKSAccess"
                    },
+                   {
+                       Action   = "eks:ListClusters"
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "AllowListClusters"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags        = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all    = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
    }

  # module.eks_blueprints.module.aws_eks_teams[0].aws_iam_role.platform_team["admin"] will be created
+   resource "aws_iam_role" "platform_team" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = [
+                               "arn:aws:iam::484752921218:user/jingood2@sk.com",
                            ]
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "jingood2-dev-eks-admin-access"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all              = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       unique_id             = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```
</details>